; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-3-8-15)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	truck8 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	package11 - obj
	package12 - obj
	package13 - obj
	package14 - obj
	package15 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	p0-3 - location
	p1-0 - location
	p1-3 - location
	p3-4 - location
	p4-1 - location
	p4-2 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s2)
	(at driver3 s0)
	(at truck1 s1)
	(empty truck1)
	(at truck2 s4)
	(empty truck2)
	(at truck3 s4)
	(empty truck3)
	(at truck4 s3)
	(empty truck4)
	(at truck5 s4)
	(empty truck5)
	(at truck6 s3)
	(empty truck6)
	(at truck7 s3)
	(empty truck7)
	(at truck8 s1)
	(empty truck8)
	(at package1 s3)
	(at package2 s1)
	(at package3 s3)
	(at package4 s0)
	(at package5 s1)
	(at package6 s3)
	(at package7 s2)
	(at package8 s1)
	(at package9 s2)
	(at package10 s1)
	(at package11 s4)
	(at package12 s4)
	(at package13 s0)
	(at package14 s2)
	(at package15 s1)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(= (time-to-walk s0 p0-3) 48)
	(= (time-to-walk p0-3 s0) 48)
	(= (time-to-walk s3 p0-3) 88)
	(= (time-to-walk p0-3 s3) 88)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(= (time-to-walk s1 p1-0) 96)
	(= (time-to-walk p1-0 s1) 96)
	(= (time-to-walk s0 p1-0) 77)
	(= (time-to-walk p1-0 s0) 77)
	(path s1 p1-3)
	(path p1-3 s1)
	(path s3 p1-3)
	(path p1-3 s3)
	(= (time-to-walk s1 p1-3) 46)
	(= (time-to-walk p1-3 s1) 46)
	(= (time-to-walk s3 p1-3) 24)
	(= (time-to-walk p1-3 s3) 24)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(= (time-to-walk s3 p3-4) 99)
	(= (time-to-walk p3-4 s3) 99)
	(= (time-to-walk s4 p3-4) 68)
	(= (time-to-walk p3-4 s4) 68)
	(path s4 p4-1)
	(path p4-1 s4)
	(path s1 p4-1)
	(path p4-1 s1)
	(= (time-to-walk s4 p4-1) 17)
	(= (time-to-walk p4-1 s4) 17)
	(= (time-to-walk s1 p4-1) 80)
	(= (time-to-walk p4-1 s1) 80)
	(path s4 p4-2)
	(path p4-2 s4)
	(path s2 p4-2)
	(path p4-2 s2)
	(= (time-to-walk s4 p4-2) 17)
	(= (time-to-walk p4-2 s4) 17)
	(= (time-to-walk s2 p4-2) 80)
	(= (time-to-walk p4-2 s2) 80)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 97)
	(= (time-to-drive s2 s0) 97)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 56)
	(= (time-to-drive s2 s1) 56)
	(link s1 s3)
	(link s3 s1)
	(= (time-to-drive s1 s3) 79)
	(= (time-to-drive s3 s1) 79)
	(link s2 s3)
	(link s3 s2)
	(= (time-to-drive s2 s3) 6)
	(= (time-to-drive s3 s2) 6)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 37)
	(= (time-to-drive s0 s3) 37)
	(link s3 s4)
	(link s4 s3)
	(= (time-to-drive s3 s4) 58)
	(= (time-to-drive s4 s3) 58)
	(link s4 s0)
	(link s0 s4)
	(= (time-to-drive s4 s0) 59)
	(= (time-to-drive s0 s4) 59)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 32)
	(= (time-to-drive s1 s4) 32)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver1 s2)
	(at driver2 s3)
	(at driver3 s4)
	(at truck1 s1)
	(at truck2 s2)
	(at truck3 s1)
	(at truck4 s0)
	(at truck5 s4)
	(at truck7 s1)
	(at truck8 s4)
	(at package1 s2)
	(at package2 s2)
	(at package3 s4)
	(at package4 s4)
	(at package5 s3)
	(at package6 s1)
	(at package7 s1)
	(at package8 s4)
	(at package9 s3)
	(at package10 s4)
	(at package11 s3)
	(at package12 s0)
	(at package14 s4)
	(at package15 s0)
	))

(:metric minimize (+ (+ (* 3  (total-time)) (* 3  (driven))) (* 2  (walked))))

)

; plan
1. (walk driver2 s2 p4-2)
   deleted: (at driver2 s2)
   added: (at driver2 p4-2)
   changed: (walked) from 0 to 80
   goals met: 3 of 24
2. (load-truck package11 truck2 s4)
   deleted: (at package11 s4)
   added: (in package11 truck2)
   goals met: 3 of 24
3. (load-truck package12 truck3 s4)
   deleted: (at package12 s4)
   added: (in package12 truck3)
   goals met: 3 of 24
4. (walk driver2 p4-2 s4)
   deleted: (at driver2 p4-2)
   added: (at driver2 s4)
   changed: (walked) from 80 to 97
   goals met: 3 of 24
5. (board-truck driver2 truck3 s4)
   deleted: (at driver2 s4) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 3 of 24
6. (drive-truck truck3 s4 s3 driver2)
   deleted: (at truck3 s4)
   added: (at truck3 s3)
   changed: (driven) from 0 to 58
   goals met: 3 of 24
7. (load-truck package6 truck3 s3)
   deleted: (at package6 s3)
   added: (in package6 truck3)
   goals met: 3 of 24
8. (unload-truck package11 truck2 s4)
   deleted: (in package11 truck2)
   added: (at package11 s4)
   goals met: 3 of 24
9. (load-truck package3 truck3 s3)
   deleted: (at package3 s3)
   added: (in package3 truck3)
   goals met: 3 of 24
10. (load-truck package1 truck3 s3)
   deleted: (at package1 s3)
   added: (in package1 truck3)
   goals met: 3 of 24
11. (walk driver3 s0 p1-0)
   deleted: (at driver3 s0)
   added: (at driver3 p1-0)
   changed: (walked) from 97 to 174
   goals met: 3 of 24
12. (drive-truck truck3 s3 s4 driver2)
   deleted: (at truck3 s3)
   added: (at truck3 s4)
   changed: (driven) from 58 to 116
   goals met: 3 of 24
13. (load-truck package11 truck3 s4)
   deleted: (at package11 s4)
   added: (in package11 truck3)
   goals met: 3 of 24
14. (drive-truck truck3 s4 s1 driver2)
   deleted: (at truck3 s4)
   added: (at truck3 s1)
   changed: (driven) from 116 to 148
   goals met: 4 of 24
15. (unload-truck package6 truck3 s1)
   deleted: (in package6 truck3)
   added: (at package6 s1)
   goals met: 5 of 24
16. (load-truck package2 truck3 s1)
   deleted: (at package2 s1)
   added: (in package2 truck3)
   goals met: 5 of 24
17. (walk driver3 p1-0 s1)
   deleted: (at driver3 p1-0)
   added: (at driver3 s1)
   changed: (walked) from 174 to 270
   goals met: 5 of 24
18. (walk driver3 s1 p4-1)
   deleted: (at driver3 s1)
   added: (at driver3 p4-1)
   changed: (walked) from 270 to 350
   goals met: 5 of 24
19. (walk driver3 p4-1 s4)
   deleted: (at driver3 p4-1)
   added: (at driver3 s4)
   changed: (walked) from 350 to 367
   goals met: 6 of 24
20. (drive-truck truck3 s1 s3 driver2)
   deleted: (at truck3 s1)
   added: (at truck3 s3)
   changed: (driven) from 148 to 227
   goals met: 5 of 24
21. (unload-truck package11 truck3 s3)
   deleted: (in package11 truck3)
   added: (at package11 s3)
   goals met: 6 of 24
22. (board-truck driver3 truck2 s4)
   deleted: (at driver3 s4) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 5 of 24
23. (drive-truck truck2 s4 s1 driver3)
   deleted: (at truck2 s4)
   added: (at truck2 s1)
   changed: (driven) from 227 to 259
   goals met: 5 of 24
24. (load-truck package8 truck2 s1)
   deleted: (at package8 s1)
   added: (in package8 truck2)
   goals met: 5 of 24
25. (load-truck package5 truck2 s1)
   deleted: (at package5 s1)
   added: (in package5 truck2)
   goals met: 5 of 24
26. (load-truck package10 truck2 s1)
   deleted: (at package10 s1)
   added: (in package10 truck2)
   goals met: 5 of 24
27. (drive-truck truck2 s1 s4 driver3)
   deleted: (at truck2 s1)
   added: (at truck2 s4)
   changed: (driven) from 259 to 291
   goals met: 5 of 24
28. (unload-truck package8 truck2 s4)
   deleted: (in package8 truck2)
   added: (at package8 s4)
   goals met: 6 of 24
29. (unload-truck package10 truck2 s4)
   deleted: (in package10 truck2)
   added: (at package10 s4)
   goals met: 7 of 24
30. (drive-truck truck2 s4 s1 driver3)
   deleted: (at truck2 s4)
   added: (at truck2 s1)
   changed: (driven) from 291 to 323
   goals met: 7 of 24
31. (drive-truck truck3 s3 s2 driver2)
   deleted: (at truck3 s3)
   added: (at truck3 s2)
   changed: (driven) from 323 to 329
   goals met: 7 of 24
32. (unload-truck package1 truck3 s2)
   deleted: (in package1 truck3)
   added: (at package1 s2)
   goals met: 8 of 24
33. (unload-truck package2 truck3 s2)
   deleted: (in package2 truck3)
   added: (at package2 s2)
   goals met: 9 of 24
34. (load-truck package7 truck3 s2)
   deleted: (at package7 s2)
   added: (in package7 truck3)
   goals met: 9 of 24
35. (load-truck package14 truck3 s2)
   deleted: (at package14 s2)
   added: (in package14 truck3)
   goals met: 9 of 24
36. (drive-truck truck3 s2 s3 driver2)
   deleted: (at truck3 s2)
   added: (at truck3 s3)
   changed: (driven) from 329 to 335
   goals met: 9 of 24
37. (drive-truck truck2 s1 s2 driver3)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   changed: (driven) from 335 to 391
   goals met: 10 of 24
38. (load-truck package9 truck2 s2)
   deleted: (at package9 s2)
   added: (in package9 truck2)
   goals met: 10 of 24
39. (disembark-truck driver3 truck2 s2)
   deleted: (driving driver3 truck2)
   added: (at driver3 s2) (empty truck2)
   goals met: 10 of 24
40. (walk driver3 s2 p4-2)
   deleted: (at driver3 s2)
   added: (at driver3 p4-2)
   changed: (walked) from 367 to 447
   goals met: 10 of 24
41. (drive-truck truck3 s3 s4 driver2)
   deleted: (at truck3 s3)
   added: (at truck3 s4)
   changed: (driven) from 391 to 449
   goals met: 10 of 24
42. (unload-truck package3 truck3 s4)
   deleted: (in package3 truck3)
   added: (at package3 s4)
   goals met: 11 of 24
43. (unload-truck package14 truck3 s4)
   deleted: (in package14 truck3)
   added: (at package14 s4)
   goals met: 12 of 24
44. (walk driver3 p4-2 s4)
   deleted: (at driver3 p4-2)
   added: (at driver3 s4)
   changed: (walked) from 447 to 464
   goals met: 13 of 24
45. (walk driver3 s4 p4-1)
   deleted: (at driver3 s4)
   added: (at driver3 p4-1)
   changed: (walked) from 464 to 481
   goals met: 12 of 24
46. (drive-truck truck3 s4 s1 driver2)
   deleted: (at truck3 s4)
   added: (at truck3 s1)
   changed: (driven) from 449 to 481
   goals met: 13 of 24
47. (unload-truck package7 truck3 s1)
   deleted: (in package7 truck3)
   added: (at package7 s1)
   goals met: 14 of 24
48. (drive-truck truck3 s1 s3 driver2)
   deleted: (at truck3 s1)
   added: (at truck3 s3)
   changed: (driven) from 481 to 560
   goals met: 13 of 24
49. (board-truck driver1 truck2 s2)
   deleted: (at driver1 s2) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 12 of 24
50. (walk driver3 p4-1 s1)
   deleted: (at driver3 p4-1)
   added: (at driver3 s1)
   changed: (walked) from 481 to 561
   goals met: 12 of 24
51. (board-truck driver3 truck8 s1)
   deleted: (at driver3 s1) (empty truck8)
   added: (driving driver3 truck8)
   goals met: 12 of 24
52. (drive-truck truck8 s1 s4 driver3)
   deleted: (at truck8 s1)
   added: (at truck8 s4)
   changed: (driven) from 560 to 592
   goals met: 13 of 24
53. (drive-truck truck2 s2 s3 driver1)
   deleted: (at truck2 s2)
   added: (at truck2 s3)
   changed: (driven) from 592 to 598
   goals met: 12 of 24
54. (unload-truck package5 truck2 s3)
   deleted: (in package5 truck2)
   added: (at package5 s3)
   goals met: 13 of 24
55. (unload-truck package9 truck2 s3)
   deleted: (in package9 truck2)
   added: (at package9 s3)
   goals met: 14 of 24
56. (drive-truck truck8 s4 s0 driver3)
   deleted: (at truck8 s4)
   added: (at truck8 s0)
   changed: (driven) from 598 to 657
   goals met: 13 of 24
57. (load-truck package4 truck8 s0)
   deleted: (at package4 s0)
   added: (in package4 truck8)
   goals met: 13 of 24
58. (drive-truck truck2 s3 s2 driver1)
   deleted: (at truck2 s3)
   added: (at truck2 s2)
   changed: (driven) from 657 to 663
   goals met: 14 of 24
59. (drive-truck truck8 s0 s4 driver3)
   deleted: (at truck8 s0)
   added: (at truck8 s4)
   changed: (driven) from 663 to 722
   goals met: 15 of 24
60. (disembark-truck driver3 truck8 s4)
   deleted: (driving driver3 truck8)
   added: (at driver3 s4) (empty truck8)
   goals met: 16 of 24
61. (disembark-truck driver1 truck2 s2)
   deleted: (driving driver1 truck2)
   added: (at driver1 s2) (empty truck2)
   goals met: 17 of 24
62. (unload-truck package4 truck8 s4)
   deleted: (in package4 truck8)
   added: (at package4 s4)
   goals met: 18 of 24
63. (drive-truck truck3 s3 s1 driver2)
   deleted: (at truck3 s3)
   added: (at truck3 s1)
   changed: (driven) from 722 to 801
   goals met: 19 of 24
64. (load-truck package15 truck3 s1)
   deleted: (at package15 s1)
   added: (in package15 truck3)
   goals met: 19 of 24
65. (drive-truck truck3 s1 s3 driver2)
   deleted: (at truck3 s1)
   added: (at truck3 s3)
   changed: (driven) from 801 to 880
   goals met: 18 of 24
66. (drive-truck truck3 s3 s0 driver2)
   deleted: (at truck3 s3)
   added: (at truck3 s0)
   changed: (driven) from 880 to 917
   goals met: 18 of 24
67. (unload-truck package12 truck3 s0)
   deleted: (in package12 truck3)
   added: (at package12 s0)
   goals met: 19 of 24
68. (unload-truck package15 truck3 s0)
   deleted: (in package15 truck3)
   added: (at package15 s0)
   goals met: 20 of 24
69. (drive-truck truck3 s0 s3 driver2)
   deleted: (at truck3 s0)
   added: (at truck3 s3)
   changed: (driven) from 917 to 954
   goals met: 20 of 24
70. (drive-truck truck3 s3 s1 driver2)
   deleted: (at truck3 s3)
   added: (at truck3 s1)
   changed: (driven) from 954 to 1033
   goals met: 21 of 24
71. (walk driver3 s4 p3-4)
   deleted: (at driver3 s4)
   added: (at driver3 p3-4)
   changed: (walked) from 561 to 629
   goals met: 20 of 24
72. (walk driver3 p3-4 s3)
   deleted: (at driver3 p3-4)
   added: (at driver3 s3)
   changed: (walked) from 629 to 728
   goals met: 20 of 24
73. (board-truck driver3 truck4 s3)
   deleted: (at driver3 s3) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 20 of 24
74. (drive-truck truck4 s3 s4 driver3)
   deleted: (at truck4 s3)
   added: (at truck4 s4)
   changed: (driven) from 1033 to 1091
   goals met: 20 of 24
75. (disembark-truck driver3 truck4 s4)
   deleted: (driving driver3 truck4)
   added: (at driver3 s4) (empty truck4)
   goals met: 21 of 24
76. (walk driver3 s4 p3-4)
   deleted: (at driver3 s4)
   added: (at driver3 p3-4)
   changed: (walked) from 728 to 796
   goals met: 20 of 24
77. (drive-truck truck3 s1 s3 driver2)
   deleted: (at truck3 s1)
   added: (at truck3 s3)
   changed: (driven) from 1091 to 1170
   goals met: 19 of 24
78. (walk driver3 p3-4 s3)
   deleted: (at driver3 p3-4)
   added: (at driver3 s3)
   changed: (walked) from 796 to 895
   goals met: 19 of 24
79. (board-truck driver3 truck7 s3)
   deleted: (at driver3 s3) (empty truck7)
   added: (driving driver3 truck7)
   goals met: 19 of 24
80. (drive-truck truck7 s3 s4 driver3)
   deleted: (at truck7 s3)
   added: (at truck7 s4)
   changed: (driven) from 1170 to 1228
   goals met: 19 of 24
81. (disembark-truck driver3 truck7 s4)
   deleted: (driving driver3 truck7)
   added: (at driver3 s4) (empty truck7)
   goals met: 20 of 24
82. (drive-truck truck3 s3 s1 driver2)
   deleted: (at truck3 s3)
   added: (at truck3 s1)
   changed: (driven) from 1228 to 1307
   goals met: 21 of 24
83. (board-truck driver3 truck4 s4)
   deleted: (at driver3 s4) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 20 of 24
84. (drive-truck truck4 s4 s0 driver3)
   deleted: (at truck4 s4)
   added: (at truck4 s0)
   changed: (driven) from 1307 to 1366
   goals met: 21 of 24
85. (walk driver1 s2 p4-2)
   deleted: (at driver1 s2)
   added: (at driver1 p4-2)
   changed: (walked) from 895 to 975
   goals met: 20 of 24
86. (drive-truck truck3 s1 s3 driver2)
   deleted: (at truck3 s1)
   added: (at truck3 s3)
   changed: (driven) from 1366 to 1445
   goals met: 19 of 24
87. (drive-truck truck4 s0 s4 driver3)
   deleted: (at truck4 s0)
   added: (at truck4 s4)
   changed: (driven) from 1445 to 1504
   goals met: 18 of 24
88. (disembark-truck driver3 truck4 s4)
   deleted: (driving driver3 truck4)
   added: (at driver3 s4) (empty truck4)
   goals met: 19 of 24
89. (disembark-truck driver2 truck3 s3)
   deleted: (driving driver2 truck3)
   added: (at driver2 s3) (empty truck3)
   goals met: 20 of 24
90. (board-truck driver3 truck7 s4)
   deleted: (at driver3 s4) (empty truck7)
   added: (driving driver3 truck7)
   goals met: 19 of 24
91. (walk driver1 p4-2 s4)
   deleted: (at driver1 p4-2)
   added: (at driver1 s4)
   changed: (walked) from 975 to 992
   goals met: 19 of 24
92. (board-truck driver1 truck4 s4)
   deleted: (at driver1 s4) (empty truck4)
   added: (driving driver1 truck4)
   goals met: 19 of 24
93. (drive-truck truck7 s4 s0 driver3)
   deleted: (at truck7 s4)
   added: (at truck7 s0)
   changed: (driven) from 1504 to 1563
   goals met: 19 of 24
94. (drive-truck truck4 s4 s0 driver1)
   deleted: (at truck4 s4)
   added: (at truck4 s0)
   changed: (driven) from 1563 to 1622
   goals met: 20 of 24
95. (board-truck driver2 truck3 s3)
   deleted: (at driver2 s3) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 19 of 24
96. (drive-truck truck7 s0 s2 driver3)
   deleted: (at truck7 s0)
   added: (at truck7 s2)
   changed: (driven) from 1622 to 1719
   goals met: 19 of 24
97. (drive-truck truck3 s3 s2 driver2)
   deleted: (at truck3 s3)
   added: (at truck3 s2)
   changed: (driven) from 1719 to 1725
   goals met: 19 of 24
98. (drive-truck truck4 s0 s2 driver1)
   deleted: (at truck4 s0)
   added: (at truck4 s2)
   changed: (driven) from 1725 to 1822
   goals met: 18 of 24
99. (disembark-truck driver3 truck7 s2)
   deleted: (driving driver3 truck7)
   added: (at driver3 s2) (empty truck7)
   goals met: 18 of 24
100. (walk driver3 s2 p4-2)
   deleted: (at driver3 s2)
   added: (at driver3 p4-2)
   changed: (walked) from 992 to 1072
   goals met: 18 of 24
101. (disembark-truck driver2 truck3 s2)
   deleted: (driving driver2 truck3)
   added: (at driver2 s2) (empty truck3)
   goals met: 18 of 24
102. (board-truck driver2 truck7 s2)
   deleted: (at driver2 s2) (empty truck7)
   added: (driving driver2 truck7)
   goals met: 18 of 24
103. (drive-truck truck7 s2 s3 driver2)
   deleted: (at truck7 s2)
   added: (at truck7 s3)
   changed: (driven) from 1822 to 1828
   goals met: 18 of 24
104. (disembark-truck driver1 truck4 s2)
   deleted: (driving driver1 truck4)
   added: (at driver1 s2) (empty truck4)
   goals met: 19 of 24
105. (board-truck driver1 truck3 s2)
   deleted: (at driver1 s2) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 18 of 24
106. (drive-truck truck3 s2 s1 driver1)
   deleted: (at truck3 s2)
   added: (at truck3 s1)
   changed: (driven) from 1828 to 1884
   goals met: 19 of 24
107. (walk driver3 p4-2 s2)
   deleted: (at driver3 p4-2)
   added: (at driver3 s2)
   changed: (walked) from 1072 to 1152
   goals met: 19 of 24
108. (board-truck driver3 truck4 s2)
   deleted: (at driver3 s2) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 19 of 24
109. (disembark-truck driver1 truck3 s1)
   deleted: (driving driver1 truck3)
   added: (at driver1 s1) (empty truck3)
   goals met: 19 of 24
110. (drive-truck truck7 s3 s1 driver2)
   deleted: (at truck7 s3)
   added: (at truck7 s1)
   changed: (driven) from 1884 to 1963
   goals met: 20 of 24
111. (disembark-truck driver3 truck4 s2)
   deleted: (driving driver3 truck4)
   added: (at driver3 s2) (empty truck4)
   goals met: 20 of 24
112. (walk driver3 s2 p4-2)
   deleted: (at driver3 s2)
   added: (at driver3 p4-2)
   changed: (walked) from 1152 to 1232
   goals met: 20 of 24
113. (drive-truck truck7 s1 s3 driver2)
   deleted: (at truck7 s1)
   added: (at truck7 s3)
   changed: (driven) from 1963 to 2042
   goals met: 19 of 24
114. (disembark-truck driver2 truck7 s3)
   deleted: (driving driver2 truck7)
   added: (at driver2 s3) (empty truck7)
   goals met: 20 of 24
115. (board-truck driver1 truck1 s1)
   deleted: (at driver1 s1) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 20 of 24
116. (walk driver3 p4-2 s2)
   deleted: (at driver3 p4-2)
   added: (at driver3 s2)
   changed: (walked) from 1232 to 1312
   goals met: 20 of 24
117. (drive-truck truck1 s1 s2 driver1)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   changed: (driven) from 2042 to 2098
   goals met: 19 of 24
118. (disembark-truck driver1 truck1 s2)
   deleted: (driving driver1 truck1)
   added: (at driver1 s2) (empty truck1)
   goals met: 20 of 24
119. (board-truck driver3 truck1 s2)
   deleted: (at driver3 s2) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 20 of 24
120. (board-truck driver1 truck4 s2)
   deleted: (at driver1 s2) (empty truck4)
   added: (driving driver1 truck4)
   goals met: 19 of 24
121. (drive-truck truck4 s2 s0 driver1)
   deleted: (at truck4 s2)
   added: (at truck4 s0)
   changed: (driven) from 2098 to 2195
   goals met: 20 of 24
122. (disembark-truck driver1 truck4 s0)
   deleted: (driving driver1 truck4)
   added: (at driver1 s0) (empty truck4)
   goals met: 20 of 24
123. (disembark-truck driver3 truck1 s2)
   deleted: (driving driver3 truck1)
   added: (at driver3 s2) (empty truck1)
   goals met: 20 of 24
124. (walk driver3 s2 p4-2)
   deleted: (at driver3 s2)
   added: (at driver3 p4-2)
   changed: (walked) from 1312 to 1392
   goals met: 20 of 24
125. (walk driver3 p4-2 s4)
   deleted: (at driver3 p4-2)
   added: (at driver3 s4)
   changed: (walked) from 1392 to 1409
   goals met: 21 of 24
126. (board-truck driver2 truck7 s3)
   deleted: (at driver2 s3) (empty truck7)
   added: (driving driver2 truck7)
   goals met: 20 of 24
127. (drive-truck truck7 s3 s2 driver2)
   deleted: (at truck7 s3)
   added: (at truck7 s2)
   changed: (driven) from 2195 to 2201
   goals met: 20 of 24
128. (disembark-truck driver2 truck7 s2)
   deleted: (driving driver2 truck7)
   added: (at driver2 s2) (empty truck7)
   goals met: 20 of 24
129. (board-truck driver2 truck1 s2)
   deleted: (at driver2 s2) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 20 of 24
130. (drive-truck truck1 s2 s3 driver2)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   changed: (driven) from 2201 to 2207
   goals met: 20 of 24
131. (disembark-truck driver2 truck1 s3)
   deleted: (driving driver2 truck1)
   added: (at driver2 s3) (empty truck1)
   goals met: 21 of 24
132. (walk driver3 s4 p4-2)
   deleted: (at driver3 s4)
   added: (at driver3 p4-2)
   changed: (walked) from 1409 to 1426
   goals met: 20 of 24
133. (walk driver3 p4-2 s2)
   deleted: (at driver3 p4-2)
   added: (at driver3 s2)
   changed: (walked) from 1426 to 1506
   goals met: 20 of 24
134. (board-truck driver3 truck7 s2)
   deleted: (at driver3 s2) (empty truck7)
   added: (driving driver3 truck7)
   goals met: 20 of 24
135. (board-truck driver2 truck1 s3)
   deleted: (at driver2 s3) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 19 of 24
136. (drive-truck truck7 s2 s0 driver3)
   deleted: (at truck7 s2)
   added: (at truck7 s0)
   changed: (driven) from 2207 to 2304
   goals met: 19 of 24
137. (drive-truck truck1 s3 s1 driver2)
   deleted: (at truck1 s3)
   added: (at truck1 s1)
   changed: (driven) from 2304 to 2383
   goals met: 20 of 24
138. (drive-truck truck7 s0 s3 driver3)
   deleted: (at truck7 s0)
   added: (at truck7 s3)
   changed: (driven) from 2383 to 2420
   goals met: 20 of 24
139. (disembark-truck driver3 truck7 s3)
   deleted: (driving driver3 truck7)
   added: (at driver3 s3) (empty truck7)
   goals met: 20 of 24
140. (walk driver3 s3 p3-4)
   deleted: (at driver3 s3)
   added: (at driver3 p3-4)
   changed: (walked) from 1506 to 1605
   goals met: 20 of 24
141. (walk driver3 p3-4 s4)
   deleted: (at driver3 p3-4)
   added: (at driver3 s4)
   changed: (walked) from 1605 to 1673
   goals met: 21 of 24
142. (drive-truck truck1 s1 s3 driver2)
   deleted: (at truck1 s1)
   added: (at truck1 s3)
   changed: (driven) from 2420 to 2499
   goals met: 20 of 24
143. (disembark-truck driver2 truck1 s3)
   deleted: (driving driver2 truck1)
   added: (at driver2 s3) (empty truck1)
   goals met: 21 of 24
144. (board-truck driver2 truck7 s3)
   deleted: (at driver2 s3) (empty truck7)
   added: (driving driver2 truck7)
   goals met: 20 of 24
145. (drive-truck truck7 s3 s1 driver2)
   deleted: (at truck7 s3)
   added: (at truck7 s1)
   changed: (driven) from 2499 to 2578
   goals met: 21 of 24
146. (walk driver1 s0 p0-3)
   deleted: (at driver1 s0)
   added: (at driver1 p0-3)
   changed: (walked) from 1673 to 1721
   goals met: 21 of 24
147. (disembark-truck driver2 truck7 s1)
   deleted: (driving driver2 truck7)
   added: (at driver2 s1) (empty truck7)
   goals met: 21 of 24
148. (walk driver2 s1 p1-3)
   deleted: (at driver2 s1)
   added: (at driver2 p1-3)
   changed: (walked) from 1721 to 1767
   goals met: 21 of 24
149. (walk driver2 p1-3 s3)
   deleted: (at driver2 p1-3)
   added: (at driver2 s3)
   changed: (walked) from 1767 to 1791
   goals met: 22 of 24
150. (board-truck driver2 truck1 s3)
   deleted: (at driver2 s3) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 21 of 24
151. (drive-truck truck1 s3 s1 driver2)
   deleted: (at truck1 s3)
   added: (at truck1 s1)
   changed: (driven) from 2578 to 2657
   goals met: 22 of 24
152. (disembark-truck driver2 truck1 s1)
   deleted: (driving driver2 truck1)
   added: (at driver2 s1) (empty truck1)
   goals met: 22 of 24
153. (walk driver1 p0-3 s3)
   deleted: (at driver1 p0-3)
   added: (at driver1 s3)
   changed: (walked) from 1791 to 1879
   goals met: 22 of 24
154. (board-truck driver1 truck6 s3)
   deleted: (at driver1 s3) (empty truck6)
   added: (driving driver1 truck6)
   goals met: 22 of 24
155. (drive-truck truck6 s3 s2 driver1)
   deleted: (at truck6 s3)
   added: (at truck6 s2)
   changed: (driven) from 2657 to 2663
   goals met: 22 of 24
156. (disembark-truck driver1 truck6 s2)
   deleted: (driving driver1 truck6)
   added: (at driver1 s2) (empty truck6)
   goals met: 23 of 24
157. (walk driver2 s1 p1-3)
   deleted: (at driver2 s1)
   added: (at driver2 p1-3)
   changed: (walked) from 1879 to 1925
   goals met: 23 of 24
158. (walk driver2 p1-3 s3)
   deleted: (at driver2 p1-3)
   added: (at driver2 s3)
   changed: (walked) from 1925 to 1949
   goals met: 24 of 24
